<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"alexa","backend":"9454ab3d916c55f88e92df640f31d471d17025373aa03af3843a1e3301d31ad6","plan_job_ref":"Job Terraform Plan #1 at https://github.com/swibrow/home-ops/actions/runs/22976423257","plan_out_hash":"fff9f4843c6416c043e20c370ba09a5707214b673478391f74e9400f5b91ee79","plan_hash":"2a4a65b07f2ae664ee2343ab6083095e661a5a95fb1d88c728e58ec2cdba5714","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __alexa__
<details>
<summary>Plan: 2 to add, 1 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.layer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "layer" {
+       id                  = (known after apply)
+       output_base64sha256 = (known after apply)
+       output_base64sha512 = (known after apply)
+       output_md5          = (known after apply)
+       output_path         = "./.build/layer.zip"
+       output_sha          = (known after apply)
+       output_sha256       = (known after apply)
+       output_sha512       = (known after apply)
+       output_size         = (known after apply)
+       source_dir          = "./.build/layer"
+       type                = "zip"
    }

  # aws_lambda_function.alexa will be updated in-place
!~  resource "aws_lambda_function" "alexa" {
        id                             = "pitower-alexa"
!~      layers                         = [
-           "arn:aws:lambda:eu-west-1:633355703129:layer:pitower-alexa-urllib3:5",
        ] -> (known after apply)
        tags                           = {
            "GithubOrg"  = "swibrow"
            "GithubRepo" = "home-ops"
            "Stack"      = "pitower-alexa"
        }
#        (31 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.urllib3 must be replaced
-/+ resource "aws_lambda_layer_version" "urllib3" {
!~      arn                         = "arn:aws:lambda:eu-west-1:633355703129:layer:pitower-alexa-urllib3:5" -> (known after apply)
!~      code_sha256                 = "qvpBOpBaVp5z/cEQs0i9g83jOS9GGK0HAYwZm8BmgRk=" -> (known after apply)
-       compatible_architectures    = [] -> null
!~      created_date                = "2026-03-10T21:57:33.314+0000" -> (known after apply)
!~      id                          = "*******************************************************************" -> (known after apply)
!~      layer_arn                   = "arn:aws:lambda:eu-west-1:633355703129:layer:pitower-alexa-urllib3" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!~      source_code_hash            = "qvpBOpBaVp5z/cEQs0i9g83jOS9GGK0HAYwZm8BmgRk=" -> (known after apply) # forces replacement
!~      source_code_size            = 292526 -> (known after apply)
!~      version                     = "5" -> (known after apply)
#        (7 unchanged attributes hidden)
    }

  # null_resource.lambda_layer must be replaced
-/+ resource "null_resource" "lambda_layer" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2026-03-10T21:57:27Z" -> (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #1](https://github.com/swibrow/home-ops/actions/runs/22976423257)